eisup_2019_docmng_integration/src/AccumulationRegisters/абс_ЗаявкиНаОбеспечение/абс_ЗаявкиНаОбеспечение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>абс_ЗаявкиНаОбеспечение</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СписаниеПартий</name>
    <comment>Запись сформирована при списании партий</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.абс_ЗаявкаНаТМЦ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/абс_ЗаявкиНаОбеспечение/ManagerModule.bsl
Процедура ВыполнитьСписаниеПоЗаявке(Движения, СтруктураШапкиДокумента, ТаблицаПоТоварам) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СтруктураШапкиДокумента.абс_ЗаявкаНаТМЦ) Тогда 
		Возврат;
	КонецЕсли;
	
	Для каждого строка из ТаблицаПоТоварам Цикл
		
		Движение 					= Движения.абс_ЗаявкиНаОбеспечение.ДобавитьРасход();
		Движение.Период             = СтруктураШапкиДокумента.Дата;
		Движение.Номенклатура 		= строка.Номенклатура;
		Движение.Склад 				= СтруктураШапкиДокумента.Склад;
		Движение.СерияНоменклатуры 	= строка.СерияНоменклатуры;
		Движение.ХарактеристикаНоменклатуры 	= строка.ХарактеристикаНоменклатуры;
		Движение.Заказ 				= СтруктураШапкиДокумента.абс_ЗаявкаНаТМЦ;
		Движение.Организация 		= СтруктураШапкиДокумента.Организация;
		
		//Если ТипЗнч(СтруктураШапкиДокумента.Ссылка) = Тип("ДокументСсылка.ТребованиеНакладная") Тогда 
			Движение.Проект 		= строка.Проект;
		//Иначе
		//	Движение.Проект 		= строка.абс_Проект;	
		//КонецЕсли;
		
		Движение.Количество  		= строка.Количество;
		Движение.СписаниеПартий 	= Истина;	
					
	КонецЦикла;

	Движения.абс_ЗаявкиНаОбеспечение.Записать();
	
КонецПроцедуры
